ProMiniMicros/ProMiniXL/Arduino Board Files/MightyCore/boards.txt
###########################################################################################################
## This file is created by MCUdude for use with MightyCore                                               ##
## https://github.com/MCUdude/MightyCore                                                                 ##
##                                                                                                       ##
## This is the file where fuse settings, clock frequencies, upload ports, bootloaders and                ##
## compiler flags are located.                                                                           ##
##                                                                                                       ##
## The table below shows the available precompiled bootloaders for the corresponding clock               ##
## frequencies and baud rates. Modify the upload.speed field to change baud rate.                        ##
##                                                                                                       ##
## |             | 1000000 | 500000 | 460800 | 250000 | 230400 | 115200 | 57600 | 38400 | 19200 | 9600 | ##
## |-------------|---------|--------|--------|--------|--------|--------|-------|-------|-------|------| ##
## | 20 MHz      |         |  X     |        |  X     |        |  X     |       |       |  X    |      | ##
## | 18.4320 MHz |         |        | X      |        |  X     |  X     |  X    |  X    |  X    |  X   | ##
## | 16 MHz      |  X      |  X     |        |  X     |        |  X     |       |  X    |  X    |  X   | ##
## | 14.7456 MHz |         |        | X      |        |  X     |  X     |  X    |  X    |  X    |  X   | ## 
## | 12 MHz      |         |  X     |        |  X     |        |  X     |  X    |       |  X    |  X   | ##
## | 11.0592 MHz |         |        | X      |        |  X     |  X     |  X    |  X    |  X    |  X   | ## 
## | 8 MHz       |  X      |  X     |        |  X     |        |  X     |  X    |  X    |  X    |  X   | ##
## | 7.3728 MHz  |         |        | X      |        |  X     |  X     |  X    |  X    |  X    |  X   | ## 
## | 4 MHz       |         |  X     |        |  X     |        |        |       |       |  X    |  X   | ##
## | 3.6864 MHz  |         |        | X      |        |  X     |  X     |  X    |  X    |  X    |  X   | ## 
## | 2 MHz       |         |        |        |  X     |        |        |       |       |  X    |  X   | ##
## | 1.8432 MHz  |         |        |        |        |  X     |  X     |  X    |  X    |  X    |  X   | ## 
## | 1 MHz       |         |        |        |        |        |        |       |       |       |  X   | ## 
##                                           |                                                           ##
###########################################################################################################

# Menu options
menu.clock=Clock
menu.BOD=BOD
menu.LTO=Compiler LTO
menu.variant=Variant
menu.pinout=Pinout
menu.bootloader=Bootloader



#####################
#### Pro Mini XL ####
#####################

# General
Pro_Mini_XL.name=Pro Mini XL
Pro_Mini_XL.upload.tool=avrdude
Pro_Mini_XL.upload.maximum_data_size=16384
Pro_Mini_XL.bootloader.tool=avrdude
Pro_Mini_XL.bootloader.unlock_bits=0x3f
Pro_Mini_XL.bootloader.lock_bits=0x0f
Pro_Mini_XL.build.core=MCUdude_corefiles
Pro_Mini_XL.build.board=AVR_ATmega1284
Pro_Mini_XL.build.extra_flags={build.clkpr}

# Upload port select
Pro_Mini_XL.menu.bootloader.uart0=Yes (UART0)
Pro_Mini_XL.menu.bootloader.uart0.upload.maximum_size=130048
Pro_Mini_XL.menu.bootloader.uart0.upload.protocol=arduino
Pro_Mini_XL.menu.bootloader.uart0.upload.port=UART0
Pro_Mini_XL.menu.bootloader.uart0.bootloader.high_fuses=0xd6
Pro_Mini_XL.menu.bootloader.uart0.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.clock_speed}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.clock_speed}_{build.bootloader_led}_BIGBOOT.hex

Pro_Mini_XL.menu.bootloader.no_bootloader=No bootloader
Pro_Mini_XL.menu.bootloader.no_bootloader.upload.maximum_size=131072
Pro_Mini_XL.menu.bootloader.no_bootloader.bootloader.high_fuses=0xd7
Pro_Mini_XL.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# Pinouts
Pro_Mini_XL.menu.pinout.v2=v2
Pro_Mini_XL.menu.pinout.v2.build.variant=pro_mini_xl_v2
Pro_Mini_XL.menu.pinout.v2.build.bootloader_led=C6
Pro_Mini_XL.menu.pinout.v1=v1
Pro_Mini_XL.menu.pinout.v1.build.variant=pro_mini_xl_v1
Pro_Mini_XL.menu.pinout.v1.build.bootloader_led=D7

# Variants
Pro_Mini_XL.menu.variant.modelP=1284P
Pro_Mini_XL.menu.variant.modelP.build.mcu=atmega1284p

# Brown out detection
Pro_Mini_XL.menu.BOD.4v3=BOD 4.3V
Pro_Mini_XL.menu.BOD.4v3.bootloader.extended_fuses=0xfc
Pro_Mini_XL.menu.BOD.2v7=BOD 2.7V
Pro_Mini_XL.menu.BOD.2v7.bootloader.extended_fuses=0xfd
Pro_Mini_XL.menu.BOD.1v8=BOD 1.8V
Pro_Mini_XL.menu.BOD.1v8.bootloader.extended_fuses=0xfe
Pro_Mini_XL.menu.BOD.disabled=BOD disabled
Pro_Mini_XL.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
Pro_Mini_XL.menu.LTO.Os=LTO disabled
Pro_Mini_XL.menu.LTO.Os.compiler.c.extra_flags=
Pro_Mini_XL.menu.LTO.Os.compiler.c.elf.extra_flags=
Pro_Mini_XL.menu.LTO.Os.compiler.cpp.extra_flags=
Pro_Mini_XL.menu.LTO.Os.ltoarcmd=avr-ar

Pro_Mini_XL.menu.LTO.Os_flto=LTO enabled
Pro_Mini_XL.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
Pro_Mini_XL.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
Pro_Mini_XL.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
Pro_Mini_XL.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
Pro_Mini_XL.menu.clock.20MHz_external=External 20 MHz
Pro_Mini_XL.menu.clock.20MHz_external.upload.speed=115200
Pro_Mini_XL.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
Pro_Mini_XL.menu.clock.20MHz_external.build.clkpr=
Pro_Mini_XL.menu.clock.20MHz_external.build.clock_speed={build.f_cpu}
Pro_Mini_XL.menu.clock.20MHz_external.build.f_cpu=20000000L

Pro_Mini_XL.menu.clock.8MHz_internal=Internal 8 MHz
Pro_Mini_XL.menu.clock.8MHz_internal.upload.speed=38400
Pro_Mini_XL.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
Pro_Mini_XL.menu.clock.8MHz_internal.build.clkpr=
Pro_Mini_XL.menu.clock.8MHz_internal.build.clock_speed={build.f_cpu}
Pro_Mini_XL.menu.clock.8MHz_internal.build.f_cpu=8000000L

