ProMiniMicros/ProMiniXL/Arduino Board Files/MightyCore/boards.txt
Pro_Mini_XL.menu.clock.1MHz_internal=Internal 1 MHz
Pro_Mini_XL.menu.clock.1MHz_internal.upload.speed=9600
Pro_Mini_XL.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
Pro_Mini_XL.menu.clock.1MHz_internal.build.clkpr=
Pro_Mini_XL.menu.clock.1MHz_internal.build.clock_speed={build.f_cpu}
Pro_Mini_XL.menu.clock.1MHz_internal.build.f_cpu=1000000L


######################
#### ATmega1284/P ####
######################

# General
1284.name=ATmega1284
1284.upload.tool=avrdude
1284.upload.maximum_data_size=16384
1284.bootloader.tool=avrdude
1284.bootloader.unlock_bits=0x3f
1284.bootloader.lock_bits=0x0f
1284.build.core=MCUdude_corefiles
1284.build.board=AVR_ATmega1284
1284.build.extra_flags={build.clkpr}

# Upload port select
1284.menu.bootloader.uart0=Yes (UART0)
1284.menu.bootloader.uart0.upload.maximum_size=130048
1284.menu.bootloader.uart0.upload.protocol=arduino
1284.menu.bootloader.uart0.upload.port=UART0
1284.menu.bootloader.uart0.bootloader.high_fuses=0xd6
1284.menu.bootloader.uart0.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.clock_speed}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.clock_speed}_{build.bootloader_led}_BIGBOOT.hex

1284.menu.bootloader.uart1=Yes (UART1)
1284.menu.bootloader.uart1.upload.maximum_size=130048
1284.menu.bootloader.uart1.upload.protocol=arduino
1284.menu.bootloader.uart1.upload.port=UART1
1284.menu.bootloader.uart1.bootloader.high_fuses=0xd6
1284.menu.bootloader.uart1.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.clock_speed}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.clock_speed}_{build.bootloader_led}_BIGBOOT.hex

1284.menu.bootloader.no_bootloader=No bootloader
1284.menu.bootloader.no_bootloader.upload.maximum_size=131072
1284.menu.bootloader.no_bootloader.bootloader.high_fuses=0xd7
1284.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# Pinouts
1284.menu.pinout.standard=Standard pinout
1284.menu.pinout.standard.build.variant=standard
1284.menu.pinout.standard.build.bootloader_led=B0
1284.menu.pinout.bobuino=Bobuino pinout
1284.menu.pinout.bobuino.build.variant=bobuino
1284.menu.pinout.bobuino.build.bootloader_led=B7
1284.menu.pinout.sanguino=Sanguino pinout
1284.menu.pinout.sanguino.build.variant=sanguino
1284.menu.pinout.sanguino.build.bootloader_led=B0

# Variants
1284.menu.variant.modelP=1284P
1284.menu.variant.modelP.build.mcu=atmega1284p
1284.menu.variant.modelNonP=1284
1284.menu.variant.modelNonP.build.mcu=atmega1284

# Brown out detection
1284.menu.BOD.2v7=BOD 2.7V
1284.menu.BOD.2v7.bootloader.extended_fuses=0xfd
1284.menu.BOD.4v3=BOD 4.3V
1284.menu.BOD.4v3.bootloader.extended_fuses=0xfc
1284.menu.BOD.1v8=BOD 1.8V
1284.menu.BOD.1v8.bootloader.extended_fuses=0xfe
1284.menu.BOD.disabled=BOD disabled
1284.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
1284.menu.LTO.Os=LTO disabled
1284.menu.LTO.Os.compiler.c.extra_flags=
1284.menu.LTO.Os.compiler.c.elf.extra_flags=
1284.menu.LTO.Os.compiler.cpp.extra_flags=
1284.menu.LTO.Os.ltoarcmd=avr-ar

1284.menu.LTO.Os_flto=LTO enabled
1284.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
1284.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
1284.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
1284.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
1284.menu.clock.16MHz_external=External 16 MHz
1284.menu.clock.16MHz_external.upload.speed=115200
1284.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.16MHz_external.build.clkpr=
1284.menu.clock.16MHz_external.build.clock_speed={build.f_cpu}
1284.menu.clock.16MHz_external.build.f_cpu=16000000L

1284.menu.clock.20MHz_external=External 20 MHz
1284.menu.clock.20MHz_external.upload.speed=115200
1284.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.20MHz_external.build.clkpr=
1284.menu.clock.20MHz_external.build.clock_speed={build.f_cpu}
1284.menu.clock.20MHz_external.build.f_cpu=20000000L

1284.menu.clock.18_432MHz_external=External 18.4320 MHz
1284.menu.clock.18_432MHz_external.upload.speed=115200
1284.menu.clock.18_432MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.18_432MHz_external.build.clkpr=
1284.menu.clock.18_432MHz_external.build.clock_speed={build.f_cpu}
1284.menu.clock.18_432MHz_external.build.f_cpu=18432000L

1284.menu.clock.14_7456MHz_external=External 14.7456 MHz
1284.menu.clock.14_7456MHz_external.upload.speed=115200
1284.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.14_7456MHz_external.build.clkpr=
1284.menu.clock.14_7456MHz_external.build.clock_speed={build.f_cpu}
1284.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

1284.menu.clock.12MHz_external=External 12 MHz
1284.menu.clock.12MHz_external.upload.speed=57600
1284.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.12MHz_external.build.clkpr=
1284.menu.clock.12MHz_external.build.clock_speed={build.f_cpu}
1284.menu.clock.12MHz_external.build.f_cpu=12000000L

1284.menu.clock.11_0592MHz_external=External 11.0592 MHz
1284.menu.clock.11_0592MHz_external.upload.speed=115200
1284.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.11_0592MHz_external.build.clkpr=
1284.menu.clock.11_0592MHz_external.build.clock_speed={build.f_cpu}
1284.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

1284.menu.clock.8MHz_external=External 8 MHz
1284.menu.clock.8MHz_external.upload.speed=57600
1284.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.8MHz_external.build.clkpr=
1284.menu.clock.8MHz_external.build.clock_speed={build.f_cpu}
1284.menu.clock.8MHz_external.build.f_cpu=8000000L

1284.menu.clock.7_3728MHz_external=External 7.3728 MHz
1284.menu.clock.7_3728MHz_external.upload.speed=115200
1284.menu.clock.7_3728MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.7_3728MHz_external.build.clkpr=
1284.menu.clock.7_3728MHz_external.build.clock_speed={build.f_cpu}
1284.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

1284.menu.clock.4MHz_external=External 4 MHz
1284.menu.clock.4MHz_external.upload.speed=9600
1284.menu.clock.4MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.4MHz_external.build.clkpr=
1284.menu.clock.4MHz_external.build.clock_speed={build.f_cpu}
1284.menu.clock.4MHz_external.build.f_cpu=4000000L

1284.menu.clock.3_6864MHz_external=External 3.6864 MHz
1284.menu.clock.3_6864MHz_external.upload.speed=115200
1284.menu.clock.3_6864MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.3_6864MHz_external.build.clkpr=
1284.menu.clock.3_6864MHz_external.build.clock_speed={build.f_cpu}
1284.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

1284.menu.clock.2MHz_external=External 2 MHz
1284.menu.clock.2MHz_external.upload.speed=9600
1284.menu.clock.2MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.2MHz_external.build.clkpr=
1284.menu.clock.2MHz_external.build.clock_speed={build.f_cpu}
1284.menu.clock.2MHz_external.build.f_cpu=2000000L

1284.menu.clock.1_8432MHz_external=External 1.8432 MHz
1284.menu.clock.1_8432MHz_external.upload.speed=115200
1284.menu.clock.1_8432MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.1_8432MHz_external.build.clkpr=
1284.menu.clock.1_8432MHz_external.build.clock_speed={build.f_cpu}
1284.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

1284.menu.clock.1MHz_external=External 1 MHz
1284.menu.clock.1MHz_external.upload.speed=9600
1284.menu.clock.1MHz_external.bootloader.low_fuses=0xf7
1284.menu.clock.1MHz_external.build.clkpr=
1284.menu.clock.1MHz_external.build.clock_speed={build.f_cpu}
1284.menu.clock.1MHz_external.build.f_cpu=1000000L

